
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 5 to change, 53 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;name&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;password&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
* Delete
  * azurerm_key_vault_secret.db_database
  * azurerm_key_vault_secret.db_host
  * azurerm_key_vault_secret.db_password
  * azurerm_key_vault_secret.db_port
  * azurerm_key_vault_secret.db_user
  * azurerm_key_vault_secret.staging_db_database
  * azurerm_key_vault_secret.staging_db_host
  * azurerm_key_vault_secret.staging_db_password
  * azurerm_key_vault_secret.staging_db_port
  * azurerm_key_vault_secret.staging_db_user
  * module.bulk-scan-db.azurerm_postgresql_active_directory_administrator.admin
  * module.bulk-scan-db.azurerm_resource_group.data-resourcegroup
  * module.bulk-scan-db.azurerm_template_deployment.postgres-paas
  * module.bulk-scan-db.null_resource.set-user-permissions[0]
  * module.bulk-scan-db.null_resource.subnet_mappings[0]
  * module.bulk-scan-db.null_resource.subnet_mappings[1]
  * module.bulk-scan-db.null_resource.subnet_mappings[2]
  * module.bulk-scan-db.null_resource.subnet_mappings[3]
  * module.bulk-scan-db.null_resource.subnet_mappings[4]
  * module.bulk-scan-db.null_resource.subnet_mappings[5]
  * module.bulk-scan-db.null_resource.subnet_mappings[6]
  * module.bulk-scan-db.null_resource.subnet_mappings[7]
  * module.bulk-scan-db.null_resource.subnet_mappings[8]
  * module.bulk-scan-db.null_resource.subnet_mappings[9]
  * module.bulk-scan-db.null_resource.subnet_mappings[10]
  * module.bulk-scan-db.null_resource.subnet_mappings[11]
  * module.bulk-scan-db.null_resource.subnet_mappings[12]
  * module.bulk-scan-db.null_resource.subnet_mappings[13]
  * module.bulk-scan-db.random_string.password
  * module.bulk-scan-staging-db.azurerm_postgresql_active_directory_administrator.admin
  * module.bulk-scan-staging-db.azurerm_resource_group.data-resourcegroup
  * module.bulk-scan-staging-db.azurerm_template_deployment.postgres-paas
  * module.bulk-scan-staging-db.null_resource.set-user-permissions[0]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[0]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[1]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[2]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[3]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[4]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[5]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[6]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[7]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[8]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[9]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[10]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[11]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[12]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[13]
  * module.bulk-scan-staging-db.random_string.password
* Replace
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.db_database will be destroyed
  # (because azurerm_key_vault_secret.db_database is not in configuration)
  - resource "azurerm_key_vault_secret" "db_database" {
      - id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-DATABASE/848499c2df804f05a5042899a924a486" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat" -> null
      - name                    = "orchestrator-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-DATABASE/versions/848499c2df804f05a5042899a924a486" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "848499c2df804f05a5042899a924a486" -> null
      - versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.db_host will be destroyed
  # (because azurerm_key_vault_secret.db_host is not in configuration)
  - resource "azurerm_key_vault_secret" "db_host" {
      - id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-HOST/bc1cf351dce2421492ebed92f2d79cbf" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat" -> null
      - name                    = "orchestrator-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-HOST/versions/bc1cf351dce2421492ebed92f2d79cbf" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "bc1cf351dce2421492ebed92f2d79cbf" -> null
      - versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.db_password will be destroyed
  # (because azurerm_key_vault_secret.db_password is not in configuration)
  - resource "azurerm_key_vault_secret" "db_password" {
      - id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-PASS/48297304890b483196634e7389b633b6" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat" -> null
      - name                    = "orchestrator-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-PASS/versions/48297304890b483196634e7389b633b6" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "48297304890b483196634e7389b633b6" -> null
      - versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.db_port will be destroyed
  # (because azurerm_key_vault_secret.db_port is not in configuration)
  - resource "azurerm_key_vault_secret" "db_port" {
      - id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-PORT/52572162569f41af92c1fd3859d44e62" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat" -> null
      - name                    = "orchestrator-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-PORT/versions/52572162569f41af92c1fd3859d44e62" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "52572162569f41af92c1fd3859d44e62" -> null
      - versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.db_user will be destroyed
  # (because azurerm_key_vault_secret.db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "db_user" {
      - id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-USER/b66e1ca13901462d80733939f855efa4" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat" -> null
      - name                    = "orchestrator-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-USER/versions/b66e1ca13901462d80733939f855efa4" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "b66e1ca13901462d80733939f855efa4" -> null
      - versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
      ~ id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-DATABASE/56aa66c2301f47d5aaf825a4f0a26d67" -> (known after apply)
      ~ name                    = "orchestrator-POSTGRES-FLEXIBLE-DATABASE" -> "orchestrator-POSTGRES-DATABASE" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-DATABASE/versions/56aa66c2301f47d5aaf825a4f0a26d67" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-DATABASE" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
      ~ version                 = "56aa66c2301f47d5aaf825a4f0a26d67" -> (known after apply)
      ~ versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-DATABASE" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
      ~ id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-HOST/c845e40dcbbe4736b23dda0c2c01ab2b" -> (known after apply)
      ~ name                    = "orchestrator-POSTGRES-FLEXIBLE-HOST" -> "orchestrator-POSTGRES-HOST" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-HOST/versions/c845e40dcbbe4736b23dda0c2c01ab2b" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-HOST" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
      ~ version                 = "c845e40dcbbe4736b23dda0c2c01ab2b" -> (known after apply)
      ~ versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-HOST" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
      ~ id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-PASS/248c07685a3548918b60a5d3989f7a1f" -> (known after apply)
      ~ name                    = "orchestrator-POSTGRES-FLEXIBLE-PASS" -> "orchestrator-POSTGRES-PASS" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-PASS/versions/248c07685a3548918b60a5d3989f7a1f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-PASS" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
      ~ version                 = "248c07685a3548918b60a5d3989f7a1f" -> (known after apply)
      ~ versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-PASS" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
      ~ id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-PORT/8e5ba2e8750f4ac3ab5bb65905e39514" -> (known after apply)
      ~ name                    = "orchestrator-POSTGRES-FLEXIBLE-PORT" -> "orchestrator-POSTGRES-PORT" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-PORT/versions/8e5ba2e8750f4ac3ab5bb65905e39514" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-PORT" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
      ~ version                 = "8e5ba2e8750f4ac3ab5bb65905e39514" -> (known after apply)
      ~ versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-PORT" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
      ~ id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-USER/a193e215b123438b9766353809f88b70" -> (known after apply)
      ~ name                    = "orchestrator-POSTGRES-FLEXIBLE-USER" -> "orchestrator-POSTGRES-USER" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-USER/versions/a193e215b123438b9766353809f88b70" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat/secrets/orchestrator-POSTGRES-FLEXIBLE-USER" -> (known after apply)
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
      ~ version                 = "a193e215b123438b9766353809f88b70" -> (known after apply)
      ~ versionless_id          = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-USER" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-host/afbb9004c9fe4e649809f4a80241f55a"
        name                    = "orchestrator-staging-db-flexible-host"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-name/029fee63271e4195a1680c4537c2ef13"
        name                    = "orchestrator-staging-db-flexible-name"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["password"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-password/2c3141cf5d7e4864aed5e589017695c0"
        name                    = "orchestrator-staging-db-flexible-password"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/orchestrator-staging-db-flexible-port/20c151962ed6495cbc31b54f5ae4c42a"
        name                    = "orchestrator-staging-db-flexible-port"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-03-05T12:59:28Z" -> (known after apply)
       

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0="
          - "env"                        = "aat"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "bulk-scan-orchestrator-staging-aat"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "bulk-scan-orchestrator-staging-data-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.bulk-scan-staging-db.null_resource.set-user-permissions[0] will be destroyed
  # (because null_resource.set-user-permissions is not in configuration)
  - resource "null_resource" "set-user-permissions" {
      - id       = "6855429719189689682" -> null
      - triggers = {
          - "db_reader_user" = "DTS CFT DB Access Reader"
          - "name"           = "bulk-scan-orchestrator-staging"
          - "script_hash"    = "03f79db43eea0260e31fe3dc6925df25b0373bdeb9982b92bedf86dfd47d593a"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "51528212394372199" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks00"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5446282266932264722" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks01"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7354485041263739193" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3312180582625397733" -> null
      - triggers = {
          - "rule_name" = "aks"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1112933218230200904" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "902350991575203633" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "722964698237246824" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks00"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8795688537309588809" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks01"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4581597065303873739" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks00"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5013637966292246841" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks01"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[10] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4250147203476225726" -> null
      - triggers = {
          - "rule_name" = "bastion-nonprod-vnet"
          - "subnet_id" = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[11] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3772721089814058569" -> null
      - triggers = {
          - "rule_name" = "idam-aat2-vnet"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[12] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8673732282750644022" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks00"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[13] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5040018867987425056" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks01"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
        } -> null
    }

  # module.bulk-scan-staging-db.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "W(Nm-X#xphBG0_qh" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "W(Nm-X#xphBG0_qh" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 5 to add, 5 to change, 53 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2605,"Program":"tfcmt","SHA1":"","Vars":{}} -->